yooaroma/yoo_stm8s_sdcc/project/STM8S_Mib/src/stm8s_mib_debug.c

/**
 ******************************************************************************
 * @file stm8s_mib_debug.c
 * @brief
 * @author MYMEDIA Co., Ltd.
 * @version V1.0.0
 * @date 2023.1.6
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include <stdio.h>
#include <math.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include "stm8s_mib_debug.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#if defined(UART_IRQ_RX_USE)
// These buffers may be any size from 2 to 256 bytes.
#define RX_BUFFER_SIZE 32
static uint8_t rx_buffer[RX_BUFFER_SIZE];
static uint8_t rx_buffer_head;
static uint8_t rx_buffer_tail;
#endif
#if defined(UART_IRQ_TX_USE)
#define TX_BUFFER_SIZE 32
static uint8_t tx_buffer[TX_BUFFER_SIZE];
static uint8_t tx_buffer_head;
static uint8_t tx_buffer_tail;
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//  PD7 : 485_DIR
#if defined(UCOM_485_USE)
#define UCOM_485_GPIO GPIOD			// PD7  //rs485 dir (rx, tx)
#define UCOM_485_PIN GPIO_PIN_7 // PD7
#define UCOM_485_MODE GPIO_MODE_OUT_PP_LOW_FAST
#define UCOM_485_DIR_HIGH (UCOM_485_GPIO->ODR |= (UCOM_485_PIN)) // GPIO_WriteHigh(UCOM_485_GPIO, UCOM_485_PIN) // tx
#define UCOM_485_DIR_LOW (UCOM_485_GPIO->ODR &= ~(UCOM_485_PIN)) // GPIO_WriteLow(UCOM_485_GPIO, UCOM_485_PIN)	 // rx
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
// #define UARTXdebug                    ((UART1_TypeDef *) UART1_BaseAddress)
// #if defined(STM8S003)
// #if defined(STM8S103)
#if defined(UART1)

//  PD5 : TXD
//  PD6 : RXD
#define UCOM_TXD_GPIO GPIOD			// PD5
#define UCOM_TXD_PIN GPIO_PIN_5 // PD5
#define UCOM_RXD_GPIO GPIOD			// PD6
#define UCOM_RXD_PIN GPIO_PIN_6 // PD6

#define UARTXdebug UART1
#define UARTX_Init UART1_Init
#define UARTX_WORDLENGTH_8D (UART1_WORDLENGTH_8D)
#define UARTX_STOPBITS_1 (UART1_STOPBITS_1)
#define UARTX_PARITY_NO (UART1_PARITY_NO)
#define UARTX_SYNCMODE_CLOCK_DISABLE (UART1_SYNCMODE_CLOCK_DISABLE)

#define UARTX_SR_TXE UART1_SR_TXE		// ((uint8_t)0x80) /*!< Transmit Data Register Empty mask */
#define UARTX_SR_TC UART1_SR_TC			// ((uint8_t)0x40) /*!< Transmission Complete mask */
#define UARTX_SR_RXNE UART1_SR_RXNE // ((uint8_t)0x20) /*!< Read Data Register Not Empty mask */
#define UARTX_SR_IDLE UART1_SR_IDLE // ((uint8_t)0x10) /*!< IDLE line detected mask */
#define UARTX_SR_OR UART1_SR_OR			// ((uint8_t)0x08) /*!< OverRun error mask */
#define UARTX_SR_NF UART1_SR_NF			// ((uint8_t)0x04) /*!< Noise Flag mask */
#define UARTX_SR_FE UART1_SR_FE			// ((uint8_t)0x02) /*!< Framing Error mask */
#define UARTX_SR_PE UART1_SR_PE			// ((uint8_t)0x01) /*!< Parity Error mask */

#define UARTX_BRR1_DIVM UART1_BRR1_DIVM // ((uint8_t)0xFF) /*!< LSB mantissa of UART1DIV [7:0] mask */

#define UARTX_BRR2_DIVM UART1_BRR2_DIVM // ((uint8_t)0xF0) /*!< MSB mantissa of UART1DIV [11:8] mask */
#define UARTX_BRR2_DIVF UART1_BRR2_DIVF // ((uint8_t)0x0F) /*!< Fraction bits of UART1DIV [3:0] mask */

#define UARTX_CR1_R8 UART1_CR1_R8				// ((uint8_t)0x80) /*!< Receive Data bit 8 */
#define UARTX_CR1_T8 UART1_CR1_T8				// ((uint8_t)0x40) /*!< Transmit data bit 8 */
#define UARTX_CR1_UARTD UART1_CR1_UARTD // ((uint8_t)0x20) /*!< UART1 Disable (for low power consumption) */
#define UARTX_CR1_M UART1_CR1_M					// ((uint8_t)0x10) /*!< Word length mask */
#define UARTX_CR1_WAKE UART1_CR1_WAKE		// ((uint8_t)0x08) /*!< Wake-up method mask */
#define UARTX_CR1_PCEN UART1_CR1_PCEN		// ((uint8_t)0x04) /*!< Parity Control Enable mask */
#define UARTX_CR1_PS UART1_CR1_PS				// ((uint8_t)0x02) /*!< UART1 Parity Selection */
#define UARTX_CR1_PIEN UART1_CR1_PIEN		// ((uint8_t)0x01) /*!< UART1 Parity Interrupt Enable mask */

#define UARTX_CR2_TIEN UART1_CR2_TIEN		// ((uint8_t)0x80) /*!< Transmitter Interrupt Enable mask */
#define UARTX_CR2_TCIEN UART1_CR2_TCIEN // ((uint8_t)0x40) /*!< Transmission Complete Interrupt Enable mask */
#define UARTX_CR2_RIEN UART1_CR2_RIEN		// ((uint8_t)0x20) /*!< Receiver Interrupt Enable mask */
#define UARTX_CR2_ILIEN UART1_CR2_ILIEN // ((uint8_t)0x10) /*!< IDLE Line Interrupt Enable mask */
#define UARTX_CR2_TEN UART1_CR2_TEN			// ((uint8_t)0x08) /*!< Transmitter Enable mask */
#define UARTX_CR2_REN UART1_CR2_REN			// ((uint8_t)0x04) /*!< Receiver Enable mask */
#define UARTX_CR2_RWU UART1_CR2_RWU			// ((uint8_t)0x02) /*!< Receiver Wake-Up mask */
#define UARTX_CR2_SBK UART1_CR2_SBK			// ((uint8_t)0x01) /*!< Send Break mask */

#define UARTX_CR3_LINEN UART1_CR3_LINEN // ((uint8_t)0x40) /*!< Alternate Function output mask */
#define UARTX_CR3_STOP UART1_CR3_STOP		// ((uint8_t)0x30) /*!< STOP bits [1:0] mask */
#define UARTX_CR3_CKEN UART1_CR3_CKEN		// ((uint8_t)0x08) /*!< Clock Enable mask */
#define UARTX_CR3_CPOL UART1_CR3_CPOL		// ((uint8_t)0x04) /*!< Clock Polarity mask */
#define UARTX_CR3_CPHA UART1_CR3_CPHA		// ((uint8_t)0x02) /*!< Clock Phase mask */
#define UARTX_CR3_LBCL UART1_CR3_LBCL		// ((uint8_t)0x01) /*!< Last Bit Clock pulse mask */

#define UARTX_CR4_LBDIEN UART1_CR4_LBDIEN // ((uint8_t)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define UARTX_CR4_LBDL UART1_CR4_LBDL			// ((uint8_t)0x20) /*!< LIN Break Detection Length mask */
#define UARTX_CR4_LBDF UART1_CR4_LBDF			// ((uint8_t)0x10) /*!< LIN Break Detection Flag mask */
#define UARTX_CR4_ADD UART1_CR4_ADD				// ((uint8_t)0x0F) /*!< Address of the UART1 node mask */

#define UARTX_CR5_SCEN UART1_CR5_SCEN		// ((uint8_t)0x20) /*!< Smart Card Enable mask */
#define UARTX_CR5_NACK UART1_CR5_NACK		// ((uint8_t)0x10) /*!< Smart Card Nack Enable mask */
#define UARTX_CR5_HDSEL UART1_CR5_HDSEL // ((uint8_t)0x08) /*!< Half-Duplex Selection mask */
#define UARTX_CR5_IRLP UART1_CR5_IRLP		// ((uint8_t)0x04) /*!< Irda Low Power Selection mask */
#define UARTX_CR5_IREN UART1_CR5_IREN		// ((uint8_t)0x02) /*!< Irda Enable mask */
// #endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
// #if defined(STM8S105)
#elif defined(UART2)

//  PD5 : TXD
//  PD6 : RXD
#define UCOM_TXD_GPIO GPIOD			// PD5
#define UCOM_TXD_PIN GPIO_PIN_5 // PD5
#define UCOM_RXD_GPIO GPIOD			// PD6
#define UCOM_RXD_PIN GPIO_PIN_6 // PD6

#define UARTXdebug UART2
#define UARTX_Init UART2_Init
#define UARTX_WORDLENGTH_8D (UART2_WORDLENGTH_8D)
#define UARTX_STOPBITS_1 (UART2_STOPBITS_1)
#define UARTX_PARITY_NO (UART2_PARITY_NO)
#define UARTX_SYNCMODE_CLOCK_DISABLE (UART2_SYNCMODE_CLOCK_DISABLE)

