yooaroma/yoo_stm8s_sdcc/project/STM8S_Mib/src/stm8s_mib_debug.c
#define UARTX_SR_TXE UART2_SR_TXE		// ((uint8_t)0x80) /*!< Transmit Data Register Empty mask */
#define UARTX_SR_TC UART2_SR_TC			// ((uint8_t)0x40) /*!< Transmission Complete mask */
#define UARTX_SR_RXNE UART2_SR_RXNE // ((uint8_t)0x20) /*!< Read Data Register Not Empty mask */
#define UARTX_SR_IDLE UART2_SR_IDLE // ((uint8_t)0x10) /*!< IDLE line detected mask */
#define UARTX_SR_OR UART2_SR_OR			// ((uint8_t)0x08) /*!< OverRun error mask */
#define UARTX_SR_NF UART2_SR_NF			// ((uint8_t)0x04) /*!< Noise Flag mask */
#define UARTX_SR_FE UART2_SR_FE			// ((uint8_t)0x02) /*!< Framing Error mask */
#define UARTX_SR_PE UART2_SR_PE			// ((uint8_t)0x01) /*!< Parity Error mask */

#define UARTX_BRR1_DIVM UART2_BRR1_DIVM // ((uint8_t)0xFF) /*!< LSB mantissa of UART2DIV [7:0] mask */

#define UARTX_BRR2_DIVM UART2_BRR2_DIVM // ((uint8_t)0xF0) /*!< MSB mantissa of UART2DIV [11:8] mask */
#define UARTX_BRR2_DIVF UART2_BRR2_DIVF // ((uint8_t)0x0F) /*!< Fraction bits of UART2DIV [3:0] mask */

#define UARTX_CR1_R8 UART2_CR1_R8				// ((uint8_t)0x80) /*!< Receive Data bit 8 */
#define UARTX_CR1_T8 UART2_CR1_T8				// ((uint8_t)0x40) /*!< Transmit data bit 8 */
#define UARTX_CR1_UARTD UART2_CR1_UARTD // ((uint8_t)0x20) /*!< UART2 Disable (for low power consumption) */
#define UARTX_CR1_M UART2_CR1_M					// ((uint8_t)0x10) /*!< Word length mask */
#define UARTX_CR1_WAKE UART2_CR1_WAKE		// ((uint8_t)0x08) /*!< Wake-up method mask */
#define UARTX_CR1_PCEN UART2_CR1_PCEN		// ((uint8_t)0x04) /*!< Parity Control Enable mask */
#define UARTX_CR1_PS UART2_CR1_PS				// ((uint8_t)0x02) /*!< UART2 Parity Selection */
#define UARTX_CR1_PIEN UART2_CR1_PIEN		// ((uint8_t)0x01) /*!< UART2 Parity Interrupt Enable mask */

#define UARTX_CR2_TIEN UART2_CR2_TIEN		// ((uint8_t)0x80) /*!< Transmitter Interrupt Enable mask */
#define UARTX_CR2_TCIEN UART2_CR2_TCIEN // ((uint8_t)0x40) /*!< Transmission Complete Interrupt Enable mask */
#define UARTX_CR2_RIEN UART2_CR2_RIEN		// ((uint8_t)0x20) /*!< Receiver Interrupt Enable mask */
#define UARTX_CR2_ILIEN UART2_CR2_ILIEN // ((uint8_t)0x10) /*!< IDLE Line Interrupt Enable mask */
#define UARTX_CR2_TEN UART2_CR2_TEN			// ((uint8_t)0x08) /*!< Transmitter Enable mask */
#define UARTX_CR2_REN UART2_CR2_REN			// ((uint8_t)0x04) /*!< Receiver Enable mask */
#define UARTX_CR2_RWU UART2_CR2_RWU			// ((uint8_t)0x02) /*!< Receiver Wake-Up mask */
#define UARTX_CR2_SBK UART2_CR2_SBK			// ((uint8_t)0x01) /*!< Send Break mask */

#define UARTX_CR3_LINEN UART2_CR3_LINEN // ((uint8_t)0x40) /*!< Alternate Function output mask */
#define UARTX_CR3_STOP UART2_CR3_STOP		// ((uint8_t)0x30) /*!< STOP bits [1:0] mask */
#define UARTX_CR3_CKEN UART2_CR3_CKEN		// ((uint8_t)0x08) /*!< Clock Enable mask */
#define UARTX_CR3_CPOL UART2_CR3_CPOL		// ((uint8_t)0x04) /*!< Clock Polarity mask */
#define UARTX_CR3_CPHA UART2_CR3_CPHA		// ((uint8_t)0x02) /*!< Clock Phase mask */
#define UARTX_CR3_LBCL UART2_CR3_LBCL		// ((uint8_t)0x01) /*!< Last Bit Clock pulse mask */

#define UARTX_CR4_LBDIEN UART2_CR4_LBDIEN // ((uint8_t)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define UARTX_CR4_LBDL UART2_CR4_LBDL			// ((uint8_t)0x20) /*!< LIN Break Detection Length mask */
#define UARTX_CR4_LBDF UART2_CR4_LBDF			// ((uint8_t)0x10) /*!< LIN Break Detection Flag mask */
#define UARTX_CR4_ADD UART2_CR4_ADD				// ((uint8_t)0x0F) /*!< Address of the UART2 node mask */

#define UARTX_CR5_SCEN UART2_CR5_SCEN // ((uint8_t)0x20) /*!< Smart Card Enable mask */
#define UARTX_CR5_NACK UART2_CR5_NACK // ((uint8_t)0x10) /*!< Smart Card Nack Enable mask */
#define UARTX_CR5_IRLP UART2_CR5_IRLP // ((uint8_t)0x04) /*!< Irda Low Power Selection mask */
#define UARTX_CR5_IREN UART2_CR5_IREN // ((uint8_t)0x02) /*!< Irda Enable mask */

#define UARTX_CR6_LDUM UART2_CR6_LDUM			// ((uint8_t)0x80) /*!< LIN Divider Update Method */
#define UARTX_CR6_LSLV UART2_CR6_LSLV			// ((uint8_t)0x20) /*!< LIN Slave Enable */
#define UARTX_CR6_LASE UART2_CR6_LASE			// ((uint8_t)0x10) /*!< LIN Auto synchronization Enable */
#define UARTX_CR6_LHDIEN UART2_CR6_LHDIEN // ((uint8_t)0x04) /*!< LIN Header Detection Interrupt Enable */
#define UARTX_CR6_LHDF UART2_CR6_LHDF			// ((uint8_t)0x02) /*!< LIN Header Detection Flag */
#define UARTX_CR6_LSF UART2_CR6_LSF				// ((uint8_t)0x01) /*!< LIN Synch Field */

#else
#error not defined UARTX
#endif

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Global variables ----------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Sends one character through a function.
 * @param  character
 * @retval None
 */
void MibWriteDebugByte(uint8_t ch)
{
#if defined(UART_IRQ_TX_USE)
	{
		uint8_t vbIndex;
		vbIndex = tx_buffer_head + 1;
		if (vbIndex >= TX_BUFFER_SIZE)
			vbIndex = 0;
		do
		{
			if (vbIndex != tx_buffer_tail)
				break;
		} while (1);
		tx_buffer[vbIndex] = ch;
		disableInterrupts()
				tx_buffer_head = vbIndex;
		if (UARTXdebug->SR & UARTX_SR_TXE)
		{ // empty..
			UARTXdebug->CR2 |= UARTX_CR2_TIEN;
		}
		enableInterrupts();
	}
#else
	{
		while (!(UARTXdebug->SR & UARTX_SR_TXE))
			;
		UARTXdebug->DR = ch;
	}
#endif
}
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Sends one character through a function.
 * @param  character
 * @retval None
 */

#if defined(UCOM_485_USE)
void MibWriteDebugByte485(uint8_t ch)
{
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_HIGH;
	}
#endif
	{
		MibWriteDebugByte(ch);
	}
#if defined(UCOM_485_USE)
	{
		while (!(UARTXdebug->SR & UARTX_SR_TC))
			;
		UARTXdebug->SR &= ~UARTX_SR_TC;
		UCOM_485_DIR_LOW;
	}
#endif
}
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Sends one character through a function.
 * @param  character
 * @retval None
 */
void MibWriteDebugEmptyCheck(void)
{
	{
		while (!(UARTXdebug->SR & UARTX_SR_TC))
			;
		UARTXdebug->SR &= ~UARTX_SR_TC;
	}
}
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Send a string through a function.
 * @param  string
 * @retval None
 */
#if 1
void MibWriteDebugString(uint8_t *v_pStr)
{
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_HIGH;
	}
#endif
	while (*v_pStr)
	{
		MibWriteDebugByte(*v_pStr++);
	}
#if defined(UCOM_485_USE)
	{
		while (!(UARTXdebug->SR & UARTX_SR_TC))
			;
		UARTXdebug->SR &= ~UARTX_SR_TC;
		UCOM_485_DIR_LOW;
	}
#endif
}
#endif 
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Send several characters through a function.
 * @param  string
 * @retval None
 */
#if 0
void MibWriteDebugStringN(uint8_t *v_pStr, uint8_t nSize)
{
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_HIGH;
	}
#endif
	while (1)
	{
		if (nSize == 0)
			break;
		MibWriteDebugByte(*v_pStr++);
		nSize--;
	}
#if defined(UCOM_485_USE)
	{
		while (!(UARTXdebug->SR & UARTX_SR_TC))
			;
		UARTXdebug->SR &= ~UARTX_SR_TC;
		UCOM_485_DIR_LOW;
	}
#endif
}
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Check incoming text messages.
 * @param  None
 * @retval character or none (0xffff)
 */
uint16_t MibReadDebugByte(void)
{
#if defined(UART_IRQ_RX_USE)
	{
		uint8_t vbCh, vbIndex;

		// while (rx_buffer_head == rx_buffer_tail) ; // wait for character
		if (rx_buffer_head == rx_buffer_tail) // wait for character
		{
			return MIB_DEBUG_READ_NODATA; // no data
		}
		vbIndex = rx_buffer_tail + 1;
		if (vbIndex >= RX_BUFFER_SIZE)
			vbIndex = 0;
		vbCh = rx_buffer[vbIndex];
		rx_buffer_tail = vbIndex;
		return (uint16_t)vbCh;
	}
#else
	{
		if (UARTXdebug->SR & UARTX_SR_RXNE) // data register empty ?
		{
			// UARTXdebug->SR &= ~UARTX_SR_RXNE;
			return (uint16_t)(UARTXdebug->DR & 0xff);
		}
		else
		{
			return MIB_DEBUG_READ_NODATA;
		}
	}
#endif
}
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
/**
 * @brief  Configure UART for the communication with HyperTerminal
 * @param  None
 * @retval None
 */

