yooaroma/yoo_stm8s_sdcc/project/STM8S_Mib/src/stm8s_mib_debug.c
/*
Control register 2 (UART_CR2)
Address offset: 0x05
Reset value: 0x00

	7 		6 		5 		4 		3 		2 		1 		0
	TIEN 	CIEN 	RIEN 	ILIEN 	TEN 	REN 	RWU 	SBK
	rw 		rw 		rw 		rw 		rw 		rw 		rw 		rw

	Bit 7 TIEN: Transmitter interrupt enable
		This bit is set and cleared by software.
		0: Interrupt is inhibited
		1: An UART interrupt is generated whenever TXE=1 in the UART_SR register

	Bit 6 TCIEN: Transmission complete interrupt enable
		This bit is set and cleared by software.
		0: Interrupt is inhibited
		1: An UART interrupt is generated whenever TC=1 in the UART_SR register

	Bit 5 RIEN: Receiver interrupt enable
		This bit is set and cleared by software.
		0: Interrupt is inhibited
		1: An UART interrupt is generated whenever OR=1 or RXNE=1 in the UART_SR register

	Bit 4 ILIEN: IDLE Line interrupt enable
		This bit is set and cleared by software.
		0: Interrupt is inhibited
		1: An UART interrupt is generated whenever IDLE=1 in the UART_SR register

	Bit 3 TEN: Transmitter enable (1) (2)
		This bit enables the transmitter. It is set and cleared by software.
		0: Transmitter is disabled
		1: Transmitter is enabled

	Bit 2 REN: Receiver enable
		This bit enables the receiver. It is set and cleared by software.
		0: Receiver is disabled
		1: Receiver is enabled and begins searching for a start bit

	Bit 1 RWU: Receiver wakeup
		? UART mode
		This bit determines if the UART is in mute mode or not. It is set and cleared by software and can be
		cleared by hardware when a wakeup sequence is recognized.(3) (4)
		? LIN slave mode (UART2, UART3 and UART4 only, if bits LINE and LSLV are set)
		While LIN is used in slave mode, setting the RWU bit allows the detection of Headers only and
		prevents the reception of any other characters. Refer to Mute mode and errors on page 355. In LIN
		slave mode, when RXNE is set, the software can not set or clear the RWU bit.
		0: Receiver in active mode
		1: Receiver in mute mode

	Bit 0 SBK: Send break
		This bit set is used to send break characters. It can be set and cleared by software.It should be set
		by software, and will be reset by hardware during the stop bit of break.

	0: No break character is transmitted
	1: Break character will be transmitted
	1. During transmission, a “0” pulse on the TEN bit (“0” followed by “1”) sends a preamble (idle line) after the current word.
	2. When TEN is set there is a 1 bit-time delay before the transmission starts.
	3. Before selecting Mute mode (by setting the RWU bit) the UART must first receive a data byte, otherwise it cannot function
	in Mute mode with wakeup by Idle line detection.
	4. In Address Mark Detection wakeup configuration (WAKE bit=1) the RWU bit cannot be modified by software while the
	RXNE bit is set.

*/

void MibDebugInit(uint32_t baudrate)
{
#if defined(UART_IRQ_RX_USE)
	{
		rx_buffer_head = 0;
		rx_buffer_tail = 0;
	}
#endif
#if defined(UART_IRQ_TX_USE)
	{
		tx_buffer_head = 0;
		tx_buffer_tail = 0;
	}
#endif
#if defined(UCOM_485_USE)
	// GPIO_Init(UCOM_485_GPIO, UCOM_485_PIN, UCOM_485_MODE);
	{																				 // TXD2
		UCOM_485_GPIO->DDR |= (UCOM_485_PIN);	 /* Set Output mode */
		UCOM_485_GPIO->CR1 |= (UCOM_485_PIN);	 /* Pull-Up or Push-Pull */
		UCOM_485_GPIO->CR2 |= (UCOM_485_PIN);	 /* Output speed up to 10 MHz */
		UCOM_485_GPIO->ODR &= ~(UCOM_485_PIN); // low...
	}
// {
// 	GPIO_Init(UCOM_485_GPIO, UCOM_485_PIN, UCOM_485_MODE); // output
// 	GPIO_WriteLow(UCOM_485_GPIO, UCOM_485_PIN);
// }
#endif

	/* EVAL COM (UART) configuration -----------------------------------------*/
	/* USART configured as follow:
		- BaudRate = 115200 baud
		- Word Length = 8 Bits
		- One Stop Bit
		- Odd parity
		- Receive and transmit enabled
		- UART Clock disabled
	*/
	{
		uint32_t BaudRate = baudrate;
		uint32_t v_ClkValue = 16000000; // CLK_GetClockFreq();

		uint8_t BRR2_1, BRR2_2 = 0;
		uint32_t BaudRate_Mantissa, BaudRate_Mantissa100 = 0;

		UARTXdebug->CR1 &= (uint8_t)(~UARTX_CR1_M);			 /**< Clear the word length bit */
		UARTXdebug->CR1 |= (uint8_t)UARTX_WORDLENGTH_8D; /**< Set the word length bit according to UART1_WordLength value */

		UARTXdebug->CR3 &= (uint8_t)(~UARTX_CR3_STOP); /**< Clear the STOP bits */
		UARTXdebug->CR3 |= (uint8_t)UARTX_STOPBITS_1;	 /**< Set the STOP bits number according to UART1_StopBits value  */

		UARTXdebug->CR1 &= (uint8_t)(~(UARTX_CR1_PCEN | UARTX_CR1_PS)); /**< Clear the Parity Control bit */
		UARTXdebug->CR1 |= (uint8_t)UARTX_PARITY_NO;										/**< Set the Parity Control bit to UART1_Parity value */

		UARTXdebug->BRR1 &= (uint8_t)(~UARTX_BRR1_DIVM); /**< Clear the LSB mantissa of UARTDIV  */
		UARTXdebug->BRR2 &= (uint8_t)(~UARTX_BRR2_DIVM); /**< Clear the MSB mantissa of UARTDIV  */
		UARTXdebug->BRR2 &= (uint8_t)(~UARTX_BRR2_DIVF); /**< Clear the Fraction bits of UARTDIV */

		/**< Set the UART2 BaudRates in BRR1 and BRR2 registers according to UART1_BaudRate value */
		BaudRate_Mantissa = ((uint32_t)v_ClkValue / (BaudRate << 4));
		BaudRate_Mantissa100 = (((uint32_t)v_ClkValue * 100) / (BaudRate << 4));
		/**< The fraction and MSB mantissa should be loaded in one step in the BRR2 register*/
		BRR2_1 = (uint8_t)((uint8_t)(((BaudRate_Mantissa100 - (BaudRate_Mantissa * 100)) << 4) / 100) & (u8)0x0F); /**< Set the fraction of UARTDIV  */
		BRR2_2 = (uint8_t)((BaudRate_Mantissa >> 4) & (u8)0xF0);

		UARTXdebug->BRR2 = (uint8_t)(BRR2_1 | BRR2_2);
		UARTXdebug->BRR1 = (uint8_t)BaudRate_Mantissa; /**< Set the LSB mantissa of UARTDIV  */

		UARTXdebug->CR2 &= (uint8_t)~(UARTX_CR2_TEN | UARTX_CR2_REN);																																			 /**< Disable the Transmitter and Receiver before seting the LBCL, CPOL and CPHA bits */
		UARTXdebug->CR3 &= (uint8_t)~(UARTX_CR3_CPOL | UARTX_CR3_CPHA | UARTX_CR3_LBCL);																									 /**< Clear the Clock Polarity, lock Phase, Last Bit Clock pulse */
		UARTXdebug->CR3 |= (uint8_t)((uint8_t)UARTX_SYNCMODE_CLOCK_DISABLE & (uint8_t)(UARTX_CR3_CPOL | UARTX_CR3_CPHA | UARTX_CR3_LBCL)); /**< Set the Clock Polarity, lock Phase, Last Bit Clock pulse */

		UARTXdebug->CR2 |= (uint8_t)UARTX_CR2_TEN; /**< Set the Transmitter Enable bit */

#if defined(UART_IRQ_RX_USE)
		{
			UARTXdebug->CR2 |= (uint8_t)UARTX_CR2_REN | UARTX_CR2_RIEN; /**< Set the Receiver Enable bit */
		}
#else
		{
			UARTXdebug->CR2 |= (uint8_t)UARTX_CR2_REN; /**< Set the Receiver Enable bit */
		}
#endif
		/**< Set the Clock Enable bit, lock Polarity, lock Phase and Last Bit Clock pulse bits according to UART1_Mode value */
		UARTXdebug->CR3 &= (uint8_t)(~UARTX_CR3_CKEN); /**< Clear the Clock Enable bit */
		/**< configure in Push Pull or Open Drain mode the Tx I/O line by setting the correct I/O Port register according the product package and line configuration*/

		{ // gpio init : PD5 : TX, PD6 : RX
			// GPIO_Init(GPIOD, GPIO_PIN_5, GPIO_MODE_OUT_PP_HIGH_FAST);
			{																				// TXD2
				UCOM_TXD_GPIO->DDR |= (UCOM_TXD_PIN); /* Set Output mode */
				UCOM_TXD_GPIO->CR1 |= (UCOM_TXD_PIN); /* Pull-Up or Push-Pull */
				UCOM_TXD_GPIO->CR2 |= (UCOM_TXD_PIN); /* Output speed up to 10 MHz */
				UCOM_TXD_GPIO->ODR |= (UCOM_TXD_PIN); // high...
			}
			// GPIO_Init(GPIOD, GPIO_PIN_6, GPIO_MODE_IN_PU_NO_IT);
			{																				 // RXD2
				UCOM_RXD_GPIO->DDR &= ~(UCOM_RXD_PIN); // Set input mode
				UCOM_RXD_GPIO->CR1 |= (UCOM_RXD_PIN);	 /* Pull-Up or Push-Pull */
				UCOM_RXD_GPIO->CR2 &= ~(UCOM_RXD_PIN); /*  External interrupt disabled */
																							 // GPIOD->ODR   = (1<<6);
			}
		}
		{
			// ITC_SetSoftwarePriority(ITC_IRQ_UART1_RX, ITC_PRIORITYLEVEL_2);
		}
	}
}
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#if 0
static const char *g_TableHex = "0123456789ABCDEF";
void MibWriteDebugTransmitHex(uint8_t data)
{
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_HIGH;
	}
#endif
	MibWriteDebugByte('.');
	if (data > 0xd)
		MibWriteDebugByte(data);
	MibWriteDebugByte('[');
	MibWriteDebugByte(g_TableHex[data >> 4]);
	MibWriteDebugByte(g_TableHex[data & 0xf]);
	MibWriteDebugByte(']');
	while (!(UARTXdebug->SR & UARTX_SR_TC))
		;
	UARTXdebug->SR &= ~UARTX_SR_TC;
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_LOW;
	}
#endif
}

//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
void MibWriteDebugTransmitHex2(uint8_t data)
{
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_HIGH;
	}
#endif
	MibWriteDebugByte('.');
	MibWriteDebugByte(g_TableHex[data >> 4]);
	MibWriteDebugByte(g_TableHex[data & 0xf]);
	while (!(UARTXdebug->SR & UARTX_SR_TC))
		;
	UARTXdebug->SR &= ~UARTX_SR_TC;
#if defined(UCOM_485_USE)
	{
		UCOM_485_DIR_LOW;
	}
#endif
}
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
#if defined(UART_IRQ_RX_USE)
void UART_RX_IRQHandler(void) /* UART RX */
{
	// RXNEIE : RXNE interrupt enable : bit5 (CR1)
	// ORE = 1, RXNE = 1;
	{
		uint8_t vbCh, vbIndex;
		if (UARTXdebug->SR & UARTX_SR_RXNE) // RXNE :  ISR.bit5 // UART1_FLAG_RXNE
		{
			vbCh = (uint8_t)(UARTXdebug->DR);
			vbIndex = rx_buffer_head + 1;
			if (vbIndex >= RX_BUFFER_SIZE)
				vbIndex = 0;
			if (vbIndex != rx_buffer_tail)
			{
				rx_buffer[vbIndex] = vbCh;
				rx_buffer_head = vbIndex;
			}
		}
		else if (UARTXdebug->SR & UARTX_SR_OR) // OE : ISR.bit4 // /*!< OverRun error flag */
		{
			vbCh = (uint8_t)(UARTXdebug->DR);
		}
	}
}
#endif
#if defined(UART_IRQ_TX_USE)
void UART_TX_IRQHandler(void) /* UART TX */
{
	// RXNEIE : RXNE interrupt enable : bit5 (CR1)
	// ORE = 1, RXNE = 1;
	{
		uint8_t vbIndex;
		if (UARTXdebug->SR & UARTX_SR_TXE)
		{
			if (tx_buffer_tail == tx_buffer_head)
			{
				UARTXdebug->CR2 &= ~(UARTX_CR2_TIEN); // disable
			}
			else
			{
				vbIndex = tx_buffer_tail + 1;
				if (vbIndex >= TX_BUFFER_SIZE)
					vbIndex = 0;
				UARTXdebug->DR = tx_buffer[vbIndex];
				tx_buffer_tail = vbIndex;
			}
		}
		// if (UARTXdebug->SR & UARTX_SR_TC)
		// {
		// 		UARTXdebug->CR2 &= ~(UARTX_CR2_TCIEN); // disable
		// }
	}
}
#endif
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------
